metro = [['Бульвар Рокоссовского', 'Черкизовская', 'Преображенская площадь', 'Сокольники', 'Красносельская', 'Комсомольская', 'Красные ворота', 'Чистые пруды', 'Лубянка', 'Охотный ряд', 'Библиотека им. Ленина', 'Кропоткинская', 'Парк культуры', 'Фрунзенская', 'Спортивная', 'Воробьёвы горы', 'Университет', 'Проспект Вернадского', 'Юго-Западная', 'Тропарёво', 'Румянцево', 'Саларьево' ],
         ['Алма-Атинская', 'Красногвардейская', 'Домодедовская', 'Орехово', 'Царицыно', 'Кантемировская', 'Каширская', 'Технопарк', 'Коломенская', 'Автозаводская', 'Павелецкая', 'Новокузнецкая', 'Театральная', 'Тверская', 'Маяковская', 'Белорусская', 'Динамо', 'Аэропорт', 'Сокол', 'Войковская', 'Водный стадион', 'Речной вокзал' ],
         ['Пятницкое шоссе', 'Митино', 'Волоколамская', 'Мякинино', 'Строгино', 'Крылатское', 'Молодежная', 'Кунцевская', 'Славянский бульвар', 'Парк Победы', 'Киевская', 'Смоленская [глуб.]', 'Арбатская [глуб.]', 'Площадь Революции', 'Курская', 'Бауманская', 'Электрозаводская', 'Семеновская', 'Партизанская', 'Измайловская', 'Первомайская', 'Щелковская'],
         ['Александровский сад', 'Арбатская', 'Смоленская', 'Киевская', 'Выставочная', 'Международная', 'Студенческая', 'Кутузовская', 'Фили', 'Багратионовская', 'Филевский парк', 'Пионерская', 'Кунцевская'],
         ['Белорусская', 'Новослободская', 'Проспект Мира', 'Комсомольская', 'Курская', 'Таганская', 'Павелецкая', 'Добрынинская', 'Октябрьская', 'Парк культуры', 'Киевская', 'Краснопресненская'],
         ['Медведково', 'Бабушкинская', 'Свиблово', 'Ботанический сад', 'ВДНХ', 'Алексеевская', 'Рижская', 'Проспект Мира', 'Сухаревская', 'Тургеневская', 'Китай-город', 'Третьяковская', 'Октябрьская', 'Шаболовская', 'Ленинский проспект', 'Академическая', 'Профсоюзная', 'Новые Черемушки', 'Калужская', 'Беляево', 'Коньково', 'Теплый Стан', 'Ясенево', 'Новоясеневская'],
         ['Котельники', 'Жулебино', 'Лермонтовский проспект', 'Выхино', 'Рязанский проспект', 'Кузьминки', 'Текстильщики', 'Волгоградский проспект', 'Пролетарская', 'Таганская', 'Китай-город', 'Кузнецкий мост', 'Пушкинская', 'Баррикадная', 'Улица 1905 года', 'Беговая', 'Полежаевская', 'Октябрьское поле', 'Щукинская', 'Спартак', 'Тушинская', 'Сходненская', 'Планерная'],
         ['Новокосино', 'Новогиреево', 'Перово', 'Шоссе Энтузиастов', 'Авиамоторная', 'Площадь Ильича', 'Марксистская', 'Третьяковская', 'Деловой центр', 'Парк Победы'],
         ['Алтуфьево', 'Бибирево', 'Отрадное', 'Владыкино', 'Петровско-Разумовская', 'Тимирязевская', 'Дмитровская', 'Савеловская', 'Менделеевская', 'Цветной бульвар', 'Чеховская', 'Боровицкая', 'Полянка', 'Серпуховская', 'Тульская', 'Нагатинская', 'Нагорная', 'Нахимовский проспект', 'Севастопольская', 'Чертановская', 'Южная', 'Пражская', 'Улица Академика Янгеля', 'Аннино', 'Бульвар Дмитрия Донского'],
         ['Петровско-Разумовская', 'Фонвизинская', 'Бутырская', 'Марьина Роща', 'Достоевская', 'Трубная', 'Сретенский бульвар', 'Чкаловская', 'Римская', 'Крестьянская застава', 'Дубровка', 'Кожуховская', 'Печатники', 'Волжская', 'Люблино', 'Братиславская', 'Марьино', 'Борисово', 'Шипиловская', 'Зябликово'],
         ['Каширская', 'Варшавская', 'Каховская'],
         ['Битцевский парк', 'Лесопарковая', 'Улица Старокачаловская', 'Улица Скобелевская', 'Бульвар адмирала Ушакова', 'Улица Горчакова', 'Бунинская аллея'],
         ['Владыкино', 'Окружная', 'Лихоборы', 'Коптево', 'Балтийская', 'Стрешнево', 'Панфиловская', 'Зорге', 'Хорошево', 'Шелепиха', 'Деловой центр', 'Кутузовская', 'Лужники', 'Площадь Гагарина', 'Крымская', 'Верхние котлы', 'ЗИЛ', 'Автозаводская', 'Дубровка', 'Угрешская', 'Новохохловская', 'Нижегородская', 'Андроновка', 'Шоссе энтузиастов', 'Соколиная гора', 'Измайлово', 'Локомотив', 'Бульвар Рокоссовского', 'Белокаменная', 'Ростокино', 'Ботанический сад']]
lines = ['Сокольническая', 'Замоскворецкая', 'Арбатско-Покровская', 'Филевская', 'Кольцевая', 'Калужско-Рижская', 'Таганско-Краснопресненская', 'Калининская', 'Серпуховско-Тимирязевская', 'Люблинско-Дмитровская', 'Каховская', 'Бутовская', 'Московское Центральное Кольцо']
developers = [155323014, 217177334]

help_msg = '''Привет, я RusAD, и я бот. В связи с этим я несколько ограничен, но кое-что все-таки могу.
Если хотите обратиться ко мне, знайте: я откликаюсь на имя Ярик и на ник RusAD, причем в данном случае регистр букв значения не играет.

Я отвечу на "привет" и "спасибо", мне не сложно.

Напишите мне "нарандомь" и дайте одно или два числа, и я скажу вам случайное число между ними или между ним и нулем.

Я могу сохранить забавные цитаты из вашей беседы. Ответьте (reply и только, forward не сработает) на сообщение, которое нужно сохранить и попросите меня добавить "в цитатник". Затем можете попросить "цитату" (обратившись, конечно же, ко мне), и я отправлю вам случайное сохраненное сообщение из вашей беседы.

Я могу напомнить вам или кому-то из ваших друзей о чем-нибуль. Обратитесь ко мне и напишите: "напомни @username через 5 минут, что нужно сделать что-то важное". Вместо "@username" можно написать "мне", тогда я напомню именно вам. Между адресатом напоминания и временем можете вставить "в чат", и тогда я отправлю сообщение не в личку, а в текущую беседу. Время можете задавать как относительное (через X часов Y минут Z секунд), так и абсолютное (18:00:00). Не обязательно указывать все три пункта, я пойму и "18:00", и "через 1 час". Но числительное должно быть записано именно числом. Само сообщение, которое я отправлю, должно быть написано после слова "что", идущего после времени напоминания, или же сразу за временем, но обрамленное в кавычки.

Я могу помочь вам с выбором. Попросите меня "Помоги решить" и дайте мне два варианта, разделенных союзом "или", и я решу, какой вариант предпочтительнее. Впрочем, я достаточно лего меняю собственное мнение, так что не стоит мне доверять решать что-то действительно важное.

Вы можете сыграть со мной в игру Supermind. Ее правила просты: я загадываю четырехзначное число, в котором цифры не повторяются, а вы пытаетесь угадать его. После каждой вашей попытки я скажу вам количество правильных цифр, стоящих на правильных позициях и количество цифр, которые присутствуют в загаданном числе, но стоят не на тех позициях, что в вашем варианте. У вас есть восемь попыток, чтобы вычислить это число! Чтобы начать игру, скажите мне "супермайнд" или "supermind", или же воспользуйтесь командой /supermind. Во время игры вы можете посмотреть таблицу предыдущих попыток, для этого скажите "история" или используйте команду /guesses. Также вы можете завершить игру досрочно, сказав "стоп".

Можете попробовать общаться со мной более-менее вольно, я буду изо всех сил стараться понять, что вы мне говорите. Но если же ваши речи будут слишком сложны для меня, я прямо отвечу, что вас не понял.

Спасибо за понимание, надеюсь, я буду вам полезен!
'''

anime_on = "Ня!"
anime_already_on = "У тебя уже включена эта опция!"
anime_off = "Хорошо"
anime_already_off = "Да ты и так не анимешник"

class replies_ru_norm:
    greetings = 'Добрый вечер, я RusAD, бот. Можете называть меня Ярик. Для того, чтобы ознакомиться с моими возможностями, спросите меня, обратившись по имени или нику, что я умею, или попросите меня рассказать о себе, или напишите /help'

    wrong_command = 'Прости, не знаю, как ответить'

    quoted = 'Схоронил'
    nothing_to_quote = 'А что сохранять-то?'

    no_quotes = 'Ничего не найдено. Пожалуйста, сначала сохраните что-нибудь'
    
    no_such_user = 'Не знаю такого'

    my_choice_is = 'Я думаю, что '
    correct_alert = 'Хорошо, напомню'
    wrong_alert = 'Пожалуйста, составьте корректный запрос'

    delete_ok = "Удалено успешно"
    delete_fail = "Я не помню, чтобы я такое сохранял"
    nothing_to_del = "А что удалять-то?"

    no_ideas = "Нет сохраненных идей"
    listening = 'Слушаю'

    sm_stop_msg = "Хорошо, заканчиваю"
    sm_bad_quantity = 'Загаданное число состоит только из четырех цифр!'
    sm_repeated_digit = 'Цифры в загаданном числе не повторяются!'
    sm_already_playing = ', я уже играю с тобой!'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введите число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажите: "Ярик, supermind" или воспользуйтесь командой /supermind'
    
    wg_notanadmin = "Вы не являетесь админом в вашей текущей активной группе, пожалуйста, смените активную группу или получите права администратора в текущей"
    wg_nevermet = "Я ни разу не встречал этого пользователя. Возможно, вы ошиблись в написании никнейма, или же мы с ним ни разу не общались"
    wg_added = 'Добавил'
    wg_changed = "Ваша активная группа изменена на "
    wg_notamemeber = "Извините, вы не состоите в этой группе. Попросите админа этой группы добавить вас в нее"
    wg_nosuchgroup = "Извините, я не знаю такой группы"
    wg_deletesucc = "Данный пользователь успешно удален из группы"
    wg_notingroup = "Кажется, данный пользователь не состоит в данной группе"
    wg_admdelsucc = "Данный пользователь успешно удален из списка администраторов группы"
    wg_notinadmins = "Кажется, данный пользователь не является админом в данной группе"
    wg_cantread = ' (не могу прочитать имя данного пользователя) '
    wg_noactive = 'У вас не выбрана активная группа'

    ok = 'Окей'

class replies_ru_bad:
    greetings = 'Привет. Я RusAD, бот. Можете называть меня Ярик. Что я могу? Напишите /help или обратитесь ко мне и попросите: "расскажи о себе"'

    wrong_command = 'И как я должен на это отвечать?'

    quoted = 'Схоронил'
    nothing_to_quote = 'А что сохранять-то?'

    no_quotes = 'Ничего не найдено. Сохранять сначала надо'
    
    no_such_user = 'Не знаю такого'

    my_choice_is = 'Я думаю, что '
    correct_alert = 'Эх, ладно, напомню'
    wrong_alert = 'Составьте корректный запрос'

    delete_ok = "Удалено успешно"
    delete_fail = "А я это сохранял?"
    nothing_to_del = "А что удалять-то?"

    no_ideas = "Нет сохраненных идей"
    listening = 'Слушаю'

    sm_stop_msg = "Ладно, ладно, заканчиваю"
    sm_bad_quantity = 'Загаданное число состоит только из четырех цифр!'
    sm_repeated_digit = 'Цифры в загаданном числе не повторяются!'
    sm_already_playing = ', я уже играю с тобой!'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введите число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажите: "Ярик, supermind" или воспользуйтесь командой /supermind'
    
    wg_notanadmin = "Вы не являетесь админом в вашей текущей активной группе, пожалуйста, смените активную группу или получите права администратора в текущей"
    wg_nevermet = "Я не знаю такого пользователя. Либо мы с ним не общались, либо вам следует правильно написать его ник"
    wg_added = 'Угу'
    wg_changed = "Ваша активная группа теперь "
    wg_notamemeber = "Вы не состоите в этой группе. Попросите админа этой группы добавить вас в нее"
    wg_nosuchgroup = "Я не знаю такой группы"
    wg_deletesucc = "Данный пользователь удален"
    wg_notingroup = "Данный пользователь не состоит в данной группе"
    wg_admdelsucc = "Данный пользователь удален из администраторов"
    wg_notinadmins = "Данный пользователь не является админом"
    wg_cantread = ' (не могу прочитать имя) '
    wg_noactive = 'Выберите активную группу сначала'

    ok = 'Как скажешь'

class replies_ru_good:
    greetings = 'Доброго времени суток, я RusAD, бот. Можете называть меня Ярик. Я даже не обижусь, если вы будете писать мое имя с маленькой буквы или кричать на меня капсом. Для того, чтобы ознакомиться с моими возможностями, спросите меня, обратившись по имени или нику, что я умею, или попросите меня рассказать о себе, или, что проще всего, напишите /help'

    wrong_command = 'Извини, не знаю как ответить. Спроси что-нибудь другое'

    quoted = 'Схоронил'
    nothing_to_quote = 'А что сохранять-то?'

    no_quotes = 'Хм, в моих записях ничего нет. Пожалуйста, сначала сохраните что-нибудь'
    
    no_such_user = 'Ой, а я его не знаю'

    my_choice_is = 'А пускай будет '
    correct_alert = 'С радостью напомню!'
    wrong_alert = 'Извините, я не разобрал ваше сообщение'

    delete_ok = "Удалено успешно"
    delete_fail = "Это не было сохранено, так что и удалять ничего не надо"
    nothing_to_del = "А что удалять-то?"

    no_ideas = "Нет сохраненных идей"
    listening = 'Слушаю и записываю!'

    sm_stop_msg = "Да не вопрос!"
    sm_bad_quantity = 'Загаданное число состоит только из четырех цифр!'
    sm_repeated_digit = 'Цифры в загаданном числе не повторяются!'
    sm_already_playing = ', я уже играю с тобой!'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введите число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажите: "Ярик, supermind" или воспользуйтесь командой /supermind'
    
    wg_notanadmin = "Вы не являетесь админом в вашей текущей активной группе, пожалуйста, смените активную группу или получите права администратора в текущей"
    wg_nevermet = "Ой, а я с таким пользователем еще не знаком. Возможно, вы ошиблись в написании никнейма, или же мы с ним ни разу не общались"
    wg_added = 'Добавил'
    wg_changed = "Ваша активная группа изменена на "
    wg_notamemeber = "Извините, вы не состоите в этой группе. Попросите админа этой группы добавить вас в нее"
    wg_nosuchgroup = "Извините, я не знаю такой группы"
    wg_deletesucc = "Данный пользователь успешно удален из группы"
    wg_notingroup = "Кажется, данный пользователь не состоит в данной группе"
    wg_admdelsucc = "Данный пользователь успешно удален из списка администраторов группы"
    wg_notinadmins = "Кажется, данный пользователь не является админом в данной группе"
    wg_cantread = ' (я не знаю его имени, к сожалению) '
    wg_noactive = 'У вас не выбрана активная группа'

    ok = 'Океюшки'


class replies_ru_tsun:
    greetings = "Здравствуйте, я RudAD, бот. Друзья зовут меня Яриком, но не то чтобы мне нравилось такое обращение. Можете спросить, что я умею, написав /help. Или вначале моё имя, потом - вопрос. Я сейчас немножко не в настроении..."

    wrong_command = 'Понятия не имею, о чём ты говоришь!'

    quoted = 'Сохранил. И зачем вообще я это делаю?'
    nothing_to_quote = 'Ты ничего не написал, идиот.'

    no_quotes = 'Тут пусто, как в твоей голове, идиот!'
    
    no_such_user = 'Никогда о таком не слышал. Кто-то из твоих друзей?'

    my_choice_is = 'Конечно же '
    correct_alert = 'Если мне только будет нечего делать, напомню.'
    wrong_alert = 'Ты опять что-то напутал, идиот.'

    delete_ok = "Удалено."
    delete_fail = "Ничего подобного не было сохранено!"
    nothing_to_del = "Удалять нечего. Я не могу удалить пустоту, дурак!"

    no_ideas = "Сначала придумай что-нибудь, глупый."
    listening = 'Не то чтобы мне хотелось тебя слушать...'

    sm_stop_msg = "Неужели уже сдаёшься? Д-дурак."
    sm_bad_quantity = 'Там всего четыре цифры. Это так сложно запомнить?'
    sm_repeated_digit = 'Цифры все разные. Ничего без меня не помнишь, глупый!'
    sm_already_playing = ', я уже играю с тобой. Не помнишь?'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введи число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажи: "Ярик, supermind" или воспользуйся командой /supermind... глупый.'
    
    wg_notanadmin = "Ты пытаешься решать вопросы, которые тебя совсем не касаются. Тебе никто не разрешал, ты не админ, идиот!"
    wg_nevermet = "Я такого не знаю. Ты даже нас друг другу не представил. Или неправильно написал имя, дурень."
    wg_added = 'Добавил.'
    wg_changed = "Активная группа изменена на "
    wg_notamemeber = "Тебя нет в этой группе. Вот ведь наглость! Попроси админа этой группы добавить тебя в неё."
    wg_nosuchgroup = "Я не знаю такой группы. Создай её для начала!"
    wg_deletesucc = "Я знал, что ты друзей не ценишь."
    wg_notingroup = "Такого никогда не было в этой группе."
    wg_admdelsucc = "Теперь он ничего не может. Ты этого хотел?"
    wg_notinadmins = "Он тут обычный пользователь. Ты опять что-то напутал, идиот?!"
    wg_cantread = ' (имя этого пользователя не читается) '
    wg_noactive = "У тебя нет активной группы. Дурак."

    ok = 'Раз ты так настаиваешь...'

class replies_ru_dere:
    greetings = "Привет, я RusAD, бот. Друзья называют меня Яриком. Если хотите узнать, что я умею, сначала напишите моё имя, затем запрос, или сразу - /help. Буду рад вам помочь."

    wrong_command = 'Мне кажется, ты что-то не так пишешь...'

    quoted = 'Сохранил. Я это... не забуду.'
    nothing_to_quote = 'Я м-могу запомнить "пустое место", если хочешь...'

    no_quotes = 'Я пока ещё ничего не помню.'
    
    no_such_user = 'М-мы не знакомы.'

    my_choice_is = 'Д-давай '
    correct_alert = 'Я напомню... да?'
    wrong_alert = 'Тут что-то не так...'

    delete_ok = "Хорошо, я это удалил."
    delete_fail = "Эт-то... ты такого не записывал."
    nothing_to_del = "Здесь пусто, вот я и не могу что-то удалить..."

    no_ideas = "У меня совсем нет идей."
    listening = 'Хорошо, расскажи.'

    sm_stop_msg = "Ладно, я понял."
    sm_bad_quantity = 'Там всего четыре цифры. Эт-то нужно для игры...'
    sm_repeated_digit = 'Цифры не должны повторяться.'
    sm_already_playing = ', я ведь уже играю с тобой.'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введи число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажи: "Ярик, supermind" или воспользуйся командой /supermind.'
    
    wg_notanadmin = "К-к сожалению, ты не админ, поэтому не можешь такого сделать."
    wg_nevermet = "Просто говорю, что мы не знакомы, это я ни к чему такому."
    wg_added = 'Теперь у нас будет ещё один человек в группе.'
    wg_changed = "Активная группа изменена на "
    wg_notamemeber = "Просто хотел предупредить, что ты не состоишь в этой группе."
    wg_nosuchgroup = "Такой группы ещё нет."
    wg_deletesucc = "Хорошо, я с ним попрощаюсь."
    wg_notingroup = "Этого человека в группе нет."
    wg_admdelsucc = "Он теперь больше не админ, да?"
    wg_notinadmins = "Эт-то не админ. Может, его сначала повысить в правах?"
    wg_cantread = ' (не могу прочесть имя пользователя) '
    wg_noactive = "У тебя нет активной группы."

    ok = 'Х-хорошо...'


class replies_ru_genki:
    greetings = "Хей, я бот RusAD. Можешь звать меня Яриком. Напиши /help, чтобы узнать, что я умею, или моё имя, а затем запрос. Надеюсь, мы подружимся!"

    wrong_command = 'Тут что-то не так. Проверь, что ты написал, пожалуйста.'

    quoted = 'Схоронил для будущих поколений. Или для нас в старости - будем читать и смеяться!'
    nothing_to_quote = 'Тут нечего запоминать. Если ты хотел ещё что-то сказать, я слушаю.'

    no_quotes = 'Цитат ещё не сохранили. Может, это повод что-то процитировать?'
    
    no_such_user = 'Я такого не знаю. Познакомишь нас?'

    my_choice_is = 'Мне кажется, '
    correct_alert = 'Без проблем, я напомню.'
    wrong_alert = 'Тут ты что-то не так написал...'

    delete_ok = "Конечно, уже удалено."
    delete_fail = "М-м... такого тут не было."
    nothing_to_del = "Здесь было пусто, так что удалять нечего. Но ведь всё не так плохо, не так ли?"

    no_ideas = "Идей пока что нет. Ждём вдохновения?"
    listening = 'Конечно, я слушаю.'

    sm_stop_msg = "Хм, хорошо, в другой раз поиграем."
    sm_bad_quantity = 'Смотри, там четыре цифры... понимаешь?'
    sm_repeated_digit = 'Цифры в числе не должны повторяться. Защита от дурака.'
    sm_already_playing = ', я и так играю с тобой, не переживай!'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введи число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажи: "Ярик, supermind" или воспользуйся командой /supermind.'
    
    wg_notanadmin = "Простые юзеры такого не могут. Попроси принять тебя в админку, вдруг не откажут."
    wg_nevermet = "Я не видел такого. Что он из себя представляет?"
    wg_added = 'В группе прибавление! Всё к лучшему.'
    wg_changed = "Время перемен? Теперь твоя активная группа - "
    wg_notamemeber = "Тебя сюда ещё не пригласили. Забыли позвать, наверное."
    wg_nosuchgroup = "Такой группы ещё нет. Значит, её можно создать!"
    wg_deletesucc = "Он был нехорошим человеком, да?"
    wg_notingroup = "По-моему, он к нам ещё не приходил. Давай его добавим для начала?"
    wg_admdelsucc = "Правильно! Власть народу!"
    wg_notinadmins = "Классно, что ты на него рассчитываешь, но у него нет лицензии на такие действия. Хех."
    wg_cantread = ' (имя пользователя написано неразборчиво) '
    wg_noactive = "У тебя нет активной группы. Поставь что-нибудь, пусть будет!"

    ok = 'Согласен.'
    

class replies_ru_deredere:
    greetings = "Привет, я RusAD, и я бот, правда, обычно меня зовут Яриком. Напиши /help, чтобы узнать больше о том, что я умею, или обратись ко мне по имени, а потом спроси что-нибудь. Очень рад тебя видеть!"

    wrong_command = 'Хм-м... я не понимаю. Переформулируй, пожалуйста.'

    quoted = 'Запомнил. Теперь я знаю о тебе больше.'
    nothing_to_quote = 'Это такое многозначительное молчание?'

    no_quotes = 'Я пока ничего не помню. Будем создавать воспоминания?'
    
    no_such_user = 'Кто этот человек? Расскажи мне о нём, я его пока не знаю.'

    my_choice_is = 'Если не уверен, выбирай первый вариант. А так мне больше нравится '
    correct_alert = 'OK, я напомню. Теперь не отвертишься!'
    wrong_alert = 'С синтаксисом что-то не так. Хорошо хоть, не с Си...'

    delete_ok = "Агам, забыли."
    delete_fail = "Не помню такого. Потому и удалить не могу, извини."
    nothing_to_del = "Здесь было пусто. Нечего удалять."

    no_ideas = "Я не помню твоих идей. Поделишься ими?"
    listening = 'Агам, слушаю.'

    sm_stop_msg = "OK, значит, в другой раз."
    sm_bad_quantity = 'В числе всего четыре цифры.'
    sm_repeated_digit = 'Цифры в числе не повторяются, попробуй ещё раз.'
    sm_already_playing = ', я уже играю с тобой, и в ближайшем обозримом будущем прекращать не собираюсь!'
    sm_beginning = "Начинаю игру с "
    sm_input = ". Введи число:"

    addwg_usage = "Использование: /add_workgroup название_группы_без_пробелов"
    addusr_usage = "Использование: /add_user @username"
    addadm_usage = "Использование: /add_adm @username"
    setactive_usage = "Использование: /set_active название_группы"
    deleteusr_usage = "Использование: /delete_user @username"
    deleteadm_usage = "Использование: /delete_adm @username"
    guesses_usage = 'Эта команда доступна только в игре Supermind. Чтобы начать игру, скажи: "Ярик, supermind" или воспользуйся командой /supermind.'
    
    wg_notanadmin = "К сожалению, ты пока не админ, чтобы делать это. Но ведь всё может измениться, а я в тебя верю."
    wg_nevermet = "Мы не знакомы. Ты его знаешь?"
    wg_added = 'Добавил. Теперь нас больше.'
    wg_changed = "Хорошо, пусть будет "
    wg_notamemeber = "Тебя нет в этой группе. Так и должно быть?"
    wg_nosuchgroup = "Я о такой группе не слышал, извини."
    wg_deletesucc = "Давай не будем больше о нём говорить."
    wg_notingroup = "Такого у нас в группе нет."
    wg_admdelsucc = "На одного админа стало меньше. Надеюсь, ты не себя удалил..."
    wg_notinadmins = "Этот пользователь и сейчас не админ. Всё ведь нормально?"
    wg_cantread = ' (имя этого пользователя мне неизвестно) '
    wg_noactive = "Активная группа не выбрана. Мне тоже так больше нравится."

    ok = 'Агам.'
